# Все карты из обычной колоды.
from classes import *

standard_cards = []

# Девочки
standard_cards += [
    GirlCard('Рябцова М.А.', 65, 65 ** 2 // 97),
    GirlCard('Болотова Елизавета', 64, 64 ** 2 // 97),
    GirlCard('Катошина Сабина', 59, 59 ** 2 // 97),
    GirlCard('Тюрикова Любовь', 52, 52 ** 2 // 97),
    GirlCard('Брагина Виктория', 50, 50 ** 2 // 97),
    GirlCard('Куликова Ульяна', 49, 49 ** 2 // 97),
    GirlCard('Воронова Любовь', 40, 40 ** 2 // 97),  # ← можешь заменить на GirlCard при желании
    GirlCard('Нелаева М.А.', 30, 30 ** 2 // 97),
]

# Мальчики
standard_cards += [
    BoyCard('Клейзер Д.К.', 80, 80 ** 2 // 97),
    BoyCard('Левандовский Г.А.', 80, 80 ** 2 // 97),
    BoyCard('Корсак Руслан', 76, 76 ** 2 // 97),
    BoyCard('Решетников Василий', 76, 76 ** 2 // 97),
    BoyCard('Марзаев Илья', 71, 71 ** 2 // 97),
    BoyCard('Сергеев Арений', 70, 70 ** 2 // 97),
    BoyCard('Юсупов Дмитрий', 70, 70 ** 2 // 97),
    BoyCard('Крупинец Николай', 69, 69 ** 2 // 97),
    BoyCard('Елисеев Олег', 66, 66 ** 2 // 97),
    BoyCard('Фимичев Иван', 66, 66 ** 2 // 97),
    BoyCard('Мешков Глеб', 65, 65 ** 2 // 97),
    BoyCard('Уваров Вячеслав', 65, 65 ** 2 // 97),
    BoyCard('Карякин А.Е.', 50, 50 ** 2 // 97),
    BoyCard('Смирнов Иван', 50, 50 ** 2 // 97),
    BoyCard('Моралес Павел', 50, 50 ** 2 // 97),
    BoyCard('Григорьев Владислав', 49, 49 ** 2 // 97),
    BoyCard('Березин Олег', 47, 47 ** 2 // 97),
    BoyCard('Нахшунов Анатолий', 47, 47 ** 2 // 97),
    BoyCard('Трейяль Олег', 44, 44 ** 2 // 97),
    BoyCard('Медвецкий Алексей', 43, 43 ** 2 // 97),
    BoyCard('Ушкало Игорь', 43, 43 ** 2 // 97),
    BoyCard('Мезенин Дмитрий', 40, 40 ** 2 // 97),
    BoyCard('Лаврентьев А.Г.', 39, 39 ** 2 // 97),
    BoyCard('Черкасов Глеб', 39, 39 ** 2 // 97),
    BoyCard('Гумматов Рашид', 37, 37 ** 2 // 97),
    BoyCard('Клюкин С.В.', 36, 36 ** 2 // 97),
    BoyCard('Якунцов Виталий', 36, 36 ** 2 // 97),
    BoyCard('Смирнов Р.М.', 35, 35 ** 2 // 97),
    BoyCard('Сладков Никита', 32, 32 ** 2 // 97),
    BoyCard('Агапов Вадим', 30, 30 ** 2 // 97),
    BoyCard('Волков Иван', 30, 30 ** 2 // 97),
    BoyCard('Красильников Василий', 30, 30 ** 2 // 97),
    BoyCard('Малахов Григорий', 30, 30 ** 2 // 97),
    BoyCard('Чистяков Денис', 30, 30 ** 2 // 97),
    BoyCard('Роленок Д.А.', 28, 28 ** 2 // 97),
    BoyCard('Пименов И.А.', 25, 25 ** 2 // 97),
]


# Преподы
standard_cards += [
	TeacherCard('Илья Апальков', 97, 97),
	TeacherCard('Антон Афонин', 96, 96),
	TeacherCard('Вадим Головкин', 85, 85),
	TeacherCard('Павел Михайлов', 85, 85),
]

# Обычная колода содержит обычные карты.
standard_deck = Deck(standard_cards)

# Колоды игрока и противника — обычные колоды.
player_deck = standard_deck.copy()
opponent_deck = standard_deck.copy()
